storage/app/step83-load-results/20260518-000053/stress_productivity_tasks.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/productivity/tasks
Document Length:        Variable

Concurrency Level:      50
Time taken for tests:   4.515 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      235028 bytes
HTML transferred:       70500 bytes
Requests per second:    110.74 [#/sec] (mean)
Time per request:       451.525 [ms] (mean)
Time per request:       9.030 [ms] (mean, across all concurrent requests)
Transfer rate:          50.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.9      0       5
Processing:     0  483 188.3    547     661
Waiting:        0  483 188.2    546     660
Total:          0  483 188.1    547     661

Percentage of the requests served within a certain time (ms)
  50%    547
  66%    569
  75%    585
  80%    591
  90%    610
  95%    627
  98%    640
  99%    648
 100%    661 (longest request)